[
  {
    "title": "Session #4",
    "date": "Monday, March 17th 2025",
    "description": "With alarms blaring and resistance mounting, the party's desperate escape plan is underway, but with foes closing in and chaos unfolding, danger is imminent, and no one will emerge unscathed.",
    "recap": "The crew has officially set off the alarms, and while there are still people alive, there is a decent resistance on the ship. Their plan is to daisy chain people onto the ship, while I imagine another group of people are opening pods and fighting resistance. I want to make the party all take damage, so that will be my main goal. Let’s create a sense of danger…"
  },
  {
    "title": "Session #3",
    "date": "Monday, March 17th 2025",
    "description": "Returning to their battered shuttle, the crew finds Karbax unconscious, Jenkins pinned by a damaged but relentless geth, and a familiar, synthesized voice revealing an unexpected connection to the Turian spectre.",
    "recap": "Ahead of you lies the shuttle as you’ve left it, the hull adorned with plasma burns and dents telling the story of your dastard escape. The line of rope leading to the shuttle doors remains tight, the door closed shut. From what you can currently see, there is no sign of the geth hitchhiker.\n\nOpening the heavy shuttle door, your eyes dart to see Karbax on the ground, unconscious. Further ahead, you see Jenkins pinned against the wall, grappled by what appears to be a tall, lanky yet damaged geth creature. Jenkins, still conscious, sees you both walk in, her breaths short and labored as the creature's tendril keeps her pinned against the bulkhead. You can see that the geth is heavily damaged, its photoreceptor flickering like an unblinking eye towards the communications console.The geth creature notices your approach. Without disrupting its work, the crackle of a distorted, synthesized voice begins emanating from the creature. The tone is low and deliberate, but unmistakable. This is the voice of the Turian spectre from the mines."
  },
  {
    "title": "Session #2",
    "date": "Monday, March 31st 2025",
    "description": "As the ship steadies itself and autopilots toward Zeal Station, the crew is granted a fleeting moment to rest before their journey takes them deeper into the unknown.",
    "recap": "As the ship begins to stabilize, your crew has a moment for respite. The ship computer is autopiloting towards ‘Zeal Station’. It will take an hour's journey. You have the ability to take a short rest if you’d like to take it.\n\nYou hear a loud chime, ding dong dee! The autopilot has completed its travel, and its destination lies deeper in the asteroid field."
  },
  {
    "title": "Session #1",
    "date": "Monday, April 7th 2025",
    "description": "Trapped deep beneath the mines after a violent collapse, the party must navigate an uncharted labyrinth while evading patrolling geth and uncovering the truth behind a mysterious shipment.",
    "recap": "Since last we left off, our party had ventured into the mines to not only start their shift, but to question the arrival of a mysterious shipment. As they were doing so, the geth arrived and began converting and attacking the defenseless miners. While the geth and their growing number of husks are continuing to patrol the mines our group has stumbled into a spectre who also seems to be doing the same. Being fired upon, the group has fallen victim to a mine collapse, and have found themselves lost in a section of the mine not yet explored some 60 feet below. Armed with a Ground penetrating scanner and Golorbiums lifeform analyzer, our party must work together to escape their predicament."
  }
]