[
  {
    "title": "Session #17",
    "date": "Monday, May 5th 2025",
    "description": "The team returned to Zeal Station to expand their base with a menagerie and hydroponics facility, diving into research, media, and roleplay-filled negotiations, culminating in a series of interviews—including the much-debated Mikey.",
    "recap": "This session was full of RP, and a better understanding of the offers on the table. While more may come as the months progress, the team has returned to Zeal Station to build their base. Deciding to clear the remaining area, our team has tasked the keepers with the construction of a new menagary, to store creatures, and a hydroponics facility, to provide a stable flow of food. In addition, a variety of research was ran, a podcast ran, and more.  The session ends with a number of interviews being held, one of which was the highly contested Mikey..."
  },
  {
    "title": "Session #16",
    "date": "Monday, April 28th 2025",
    "description": "The party uncovered signs of sabotage on the station, turned its defenses against the Geth, and discovered the murdered administrator as the Alliance fleet awaited their command.",
    "recap": "As the party wrapped up their fight with the Heretic Prime, they were thrown into yet another trap set by Saren. With the physical bombs a trap, the real explosion came from Heretic Prime itself. The explosion ripped through the space station, knocking Korpal and Tardie unconscious and sending the rest of our party flying. Despite losing THOR to the vacuum of space, our core party returned unscathed. Heading to Eden Prime, they collected Karbaxs' son and also met a survivor from the biotics school. After their interaction, they returned to the dreadnaught for debrief. There was an award ceremony, medals were passed out, and the council was present. For some, this was a harrowing experience."
  },
  {
    "title": "Session #15",
    "date": "Monday, April 14th 2025",
    "description": "After accepting the surrender of sentient Geth, the party battled station-wide threats, confronted a Hanar saboteur, and witnessed Saren and Sovereign’s escape.",
    "recap": "The session begins with the surrender of two Geth who had gained sentience. It would seem that they have lost their connection to sovereign, and have come to their own conclusions. Wary, the party accepted their surrender, and left them to stay under the guard of the Alliance Navy. In the meantime, the Alliance fleet was called in, and the fight broke out across the stations interior and exterior. The party rushed up the elevator, and spots the Hanar saboteur on the station. Despite their efforts, another life was claimed before Xenas was subdued. The party join the rest of the marines, and charge into battle. As they enter the room with multiple explosives, Saren and Sovereign both escape the system, likely with something found in tow."
  },
  {
    "title": "Session #14",
    "date": "Monday, April 7th 2025",
    "description": "Surviving a devastating explosion triggered by Heretic Prime, the party regrouped on Eden Prime before receiving medals in a somber award ceremony aboard the dreadnaught.",
    "recap": "The party started the session by witnessing Lazarus be sucked into pocket dimensional space by Glitch, before disappearing completely. One of the LOKI units seems to have gained sentience, and joined the party in his place. While investigating the stations administration rooms, they discovered the presence of potential sabotage on the station. After, the party engaged with a disorganized Geth defense, they were able to defeat those guarding the station defenses. Suprisingly, some surrended, pending questioning by the party. Before the session ended, the station defenses were turned on the geth thanks to the parties efforts, and some massive rolls allowed the party to severely diminish the Geth fleet. Korpal also discovered the Stations Administrative heads office, and found the body of the Administrator pierced by a strange needle laced with a neurotoxin. The System Alliance fleet awaits the parties command to engage."
  },
  {
    "title": "Session #13",
    "date": "Monday, March 17th 2025",
    "description": "The party rigs the school with explosives, successfully taunts Saren into a trap, and prepares for the explosive showdown.",
    "recap": "The party searches the school up and down, and find a number of useful things within. They prepare traps, and an eventual trick against Saren. Rigging the school to explode by an air strike, Korpal taunts Saren and is successful in trapping him. This did however come at a cost, as the children were left to fend for themselves. At least two were killed in action, the rest of the field trip is considered MIA. The party drives a school bus and is loosely chased by Geth dropships as most of them were successfully brought down by the explosion. Presumably a bus driver in their former life, Golorbium expertly lands the craft near the Space Elevator. Employing the window of opportunity, the party boards the space elevator and sends themselves up into Oroborous. On their way out, they trigger a plasma storm to great effect, and the heavy Geth presence on Eden Prime seems neutralized. The session continues as the party board the Space Station. There, the party finds it crawling with Geth, the oxygen shut off. The session ends with a small fight, and an uncertainty towards the Geth response."
  },
  {
    "title": "Session #12",
    "date": "Monday, March 10th 2025",
    "description": "The party bonds while avoiding Saren, discovers Scarfy in the subway tunnels, and learns Dutch has been captured along with a group of school children, forcing them to plan a confrontation at Edison Elementary.",
    "recap": "The party continues to hide from Saren, and spend more time bonding with eachother. They continue to be cryptic with Dutch, and worry that he may have already been captured. Regardless, the party heads to the city outskirts, reaching closer to Edison Elementary. They take refuge in one of the old subway tunnels, where they rest. During shifts, the party learns even more about eachother, and spends their time being pickpocketed by cows, and shooting defenseless robots. Its there they encounter Scarfy for the first time. They also spend time preparing for escape with Dutch, where they catch a slip up with Saren. Saren has captured Dutch, and a group of elementary school students ona  field trip. Its' there that they agree to confront Saren at Edison Elementary. The session ends with the party preparing their potential combat, and think about how they might outwit Saren."
  },
  {
    "title": "Session #11",
    "date": "Monday, March 3rd 2025",
    "description": "Surrounded by Geth and hunted by Saren, the party narrowly escapes by slowfalling from the tower, loses contact with Dutch, hides in the city’s tunnels, and ultimately decides to find Scarfy at Edison Elementary.",
    "recap": "The party is encircled by the geth retaliatory party, and Saren is quick to close his grip. Choosing the riskiest option, the party jumps from the towers. Using slowfall, Olot is able to keep the party afloat as Geth units of various styles assault the group. Almost losing his life, Kroger is able to just barely grab on, and the party lands on a news station. It is there that Saren is one step ahead of them, and begins to chase the party through the city. Its' there they losee contact with Dutch, and fear the worst. Hiding in the tunnels like rats, the party eventually comes into contact with Dutch, and has learned he and his men are in a horrible predicament. The party initially agrees to meet with Dutch at an old power station, before quickly abandoning the idea. A tough decision is made, and the party agrees to let Lazarus speak with Dutch further away. In the meantime, the party makes camp in an old Police Supply Cache. The situation is grim. The session ends with people taking shifts speaking with one another, and the ultimate decision to head to Edison Elementary to find Scarfy. Everyone has varying dreams while under the Reaper."
  },
  {
    "title": "Session #10",
    "date": "Monday, February 17th 2025",
    "description": "After a brutal battle, the party secures the Arcology tower, defeats a boss, restores power, and gains the ability to control Eden Prime’s weather.",
    "recap": "The fight continues, and after another death from Lazarus, is successful in defeating the geth resistance on the first floor. Heading to the top, the situation in the control room is dire. The party, battered and bruised from the last fight, encounters another boss fight. They are quite successful in their combat, and end up restoring the controls to the Arcology tower. In doing so, they are able to deactivate the storm and return things to normal. They also receive the powers to control the weather on Eden Prime, foreshadowing for later."
  },
  {
    "title": "Session #9",
    "date": "Monday, February 10th 2025",
    "description": "The party joins the battle for the Arcology towers, fights through the lobby, and ends the session with Korpal being violently thrown.",
    "recap": "The great Arcology fight, the group embarks in a Car shuttle to the towers. Splitting up to take both towers, Sgt. Dutch takes the furthermost one, while the party takes the closer. Seeing the threat inside, the party fights their way through the lobby. The session ends with  Korpal being thrown like a ragdoll."
  },
  {
    "title": "Session #8",
    "date": "Monday, January 27th 2025",
    "description": "Upon landing on Eden Prime, the party witnesses a Reaper impact, escorts medics, faces anti-alien sentiment, tames an Alpha Varren, meets Sgt. Dutch, and uncovers Karbax's troubled past with his son Scott.",
    "recap": "As the party begins their landing, they see as the reaper also lands onto the planet. A large shockwave is seen, and you can see what appears to be a massive crater where the landing zone was made. The party disembarks from the ship, and head onto Eden Prime for the first time. Escorting the medical personell, they discover humanity's apprehension for alien species. The party rests at a nearby watering hole, and  encounter Varren and Space cows. Being Golorbium, she asks for assistance in capturing the Alpha Varren. Successful in their hunt, Golorbium begins the taming process, while Korpal games the system for rations, freezing them to store. Not long from this point, the party meets up with local resistance and Sgt. Dutch for the first time. The party learns of the situation on the ground, and opts to join the Sgt. in retaking the Arcology towers. They also meet a local shopkeep, where Olot makes fast friends with. Important goods were used, peanut butter among the most crucial. They also meet with Scott Renner, who is hesitant to return to Karbax. It is discovered that Karbax has a dark past, and the party grapples with trust. The party makes a shaky promise with Scott to save 'Scarfy', his beloved Pyjak."
  },
  {
    "title": "Session #7",
    "date": "Thursday, January 23th 2025",
    "description": "The party rescues as many crew members as possible, acquires blueprints for the Echo of Eternity, chooses to save medical personnel over stopping a fleeing Geth ship, and sets course for Eden Prime.",
    "recap": "Picking up in the midst of combat, out party attempts to save as many crew members as possible. In the meantime, Korpal studies the strange Geth ship and gleams a number of mysterious blueprints. Their use unknown, he does determine a frontal shield for use on the Echo of Eternity. After saving the crew, the party is given a choice between stopping a Geth ship from escaping, or saving medical personell on another vessel. Choosing the medical personell, the party nets further Paragon points. After this, Captain Bernard asks the party for another favor, to bring Ben Atkins and his medical crew to Eden Prime. Accepting, the party determines their landing zone and ends the session. In the meantime, Captain Bernard and her fleet head to restore Galactic Communication."
  },
  {
    "title": "Session #6",
    "date": "Thursday, January 9th 2025",
    "description": "After defusing a standoff with a Geth stalker, the party rescues Lazarus, plans with Legacy, and heads to aid a stranded Alliance fleet, only to find a mysterious energy field keeping the ships offline.",
    "recap": "This session opens with a heated standoff with a geth stalker holding Karbax and Jenkins hostage. Expert maneuver by both party members not only defuses the situation, but keeps both Karbax and Jenkins alive. After reconstruction, Lazarus seems to be back to 'normal', and the rest of the party.. rests. After some well deserved Zzzs', the group meets with Legacy to determine a game plan. Karbax also talks about his son Scott Renner on Eden Prime. Detecting a group of Alliance ships trapped, the party heads to save the fleet. On arrival, a mysterious technology is being employed, as it seems that the bubble being projected is keeping the ships offline. After boarding, the party quickly encounters prisoners, and prepares for an ambush. Golorbium also encounters creatures, but is unable to tame them. The session ends with Kroger preparing to charge a geth trooper."
  },
  {
    "title": "Session #5",
    "date": "Monday, December 16st 2024",
    "description": "The party arrives at the abandoned ZEAL Station, awakens the Prothean AI 'Legacy,' learns of the Reaper threat, gains a new stealth ship, and encounters the malfunctioning 'Glitch' while investigating a possible Geth signal.",
    "recap": "The party enters ZEAL Station, and explores it to be abandoned. Once a prominent Prothean research station, it was now left in a state of disrepair. For others in the party, it appeared to be a base of great opportunity. Utilized properly, our party may yet unlock the secrets of this treasure trove. As they delved further, they powered on and activated ZEAL station, causing the Prothean AI 'Legacy' to awaken from its slumber. Appearing friendly, it explained the horrors of the Reapers and the oncoming end of cycle. Armed with this knowledge, and the promise of wads of credits, the party sets off with good intentions. To aid in their journey, the party also gains access to their first ship, 'The Echo of Eternity', a light stealth vessel. Additionally, the appearance of 'Glitch' is sighted for the first time. Clearly dyfunctional, it asked Golorbium and Korpal to help reconstruct Lazarus. The session ends with Kroger and Olot investigating a potential geth signature on the shuttle."
  },
  {
    "title": "Session #4",
    "date": "Thursday, December 5st 2024",
    "description": "Karbax takes down a Geth dropship in a dogfight while the rest of the party fights to rescue Jenkins, then they navigate through a perilous asteroid field where Lazarus is seemingly lost.",
    "recap": "As the fight raged to save Jenkins, Karbax piloting the shuttle engaged into a dogfight with the geth dropship. Despite all odds, Karbax was not only able to take it down, but also save the party on Kelvin. As the geth closed in, Kroger fell into a blood rage and narrowly avoided death. Once in space, the party decided to navigate to ZEAL station through the perilous asteroid fields. Despite their skills, Lazarus was fated to be pancaked by asteroids colliding into the shuttle. While his fate was uncertain, many of our party feared the worst."
  },
  {
    "title": "Session #3",
    "date": "Thursday, November 21st 2024",
    "description": "The party receives an SOS from Jenkins, debates their course of action, then descends onto Kelvin-1b, abandoning stealth in favor of direct combat, ultimately rescuing Jenkins from a water tank and battling their way to safety.",
    "recap": "The party, after receiving an SOS from Jenkins. After much debate, the party decides to head to the moon. The party  descends back onto Kelvin-1b to save Jenkins from almost certain death. Quickly throwing away the option for stealth, the party plunges into deadly combat. There, they encounter powerful Geth, and discover that Jenkins has been hiding in a water tank. Freeing Jenkins, the party fights their way out "
  },
  {
    "title": "Session #2",
    "date": "Thursday, November 7th 2024",
    "description": "The party, pursued by Saren and undead threats, explores Prothean ruins, solves an alien puzzle, fights through a husk horde, and narrowly escapes on a railgun-linked shuttle, only to find themselves stranded in space with a mysterious message from 'JNK.'",
    "recap": "At the start of this session, they were being hunted. Not only by Saren, but a creeping threat of the undead. As they progressed deeper into the mines, Golorbiums lifeform scanner picked up the trail of hundreds of glowing silkworms. This trail led further, until they stumbled upon a strange spherical device. Using clever alien soduku skills, the party was presented with a vision from the life of a Prothean. As the story progressed, Golorbium encountered a strange looking tardigrade creature. Continuing, our party fought their way through a Prothean vault to escape a husk horde. In doing so, they discover and use a shuttle linked to a railgun. After ruthlessly killing their former boss Jaleel, the party narrowly escapes with their lives. Now stranded in space, the party determines their next course of action. The autopilot locked Zeal in, but they also received a message from a familiar callsign, 'JNK'...."
  },
  {
    "title": "Session #1",
    "date": "Thursday, October 24th 2024",
    "description": "Trapped deep beneath the mines after a violent collapse, the party must navigate an uncharted labyrinth while evading patrolling geth and uncovering the truth behind a mysterious shipment.",
    "recap": "Since last we left off, our party had ventured into the mines to not only start their shift, but to question the arrival of a mysterious shipment. As they were doing so, the geth arrived and began converting and attacking the defenseless miners. While the geth and their growing number of husks are continuing to patrol the mines our group has stumbled into a spectre who also seems to be doing the same. Being fired upon, the group has fallen victim to a mine collapse, and have found themselves lost in a section of the mine not yet explored some 60 feet below. Armed with a Ground penetrating scanner and Golorbiums lifeform analyzer, our party must work together to escape their predicament."
  }
]